espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_hid_report.c
/***************************************************************************//**
 * @file
 * @brief USB Device Hid report
 *******************************************************************************
 * # License
 * <b>Copyright 2021 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc.  Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement.
 * The software is governed by the sections of the MSLA applicable to Micrium
 * Software.
 *
 ******************************************************************************/

/********************************************************************************************************
 ********************************************************************************************************
 *                                               INCLUDE FILES
 ********************************************************************************************************
 *******************************************************************************************************/

#include <stdlib.h>
#include <string.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include "sl_bit.h"
#include "sl_status.h"
#include "sl_malloc.h"

#include "em_core.h"

#include "sl_usbd_core.h"
#include "sli_usbd_core.h"

#include "sl_usbd_class_hid.h"
#include "sli_usbd_class_hid.h"
#include "sli_usbd_class_hid_os.h"

/********************************************************************************************************
 ********************************************************************************************************
 *                                               LOCAL DEFINES
 ********************************************************************************************************
 *******************************************************************************************************/

/********************************************************************************************************
 *                                               HID DEFINES
 *******************************************************************************************************/

#define  SLI_USBD_HID_REPORT_ITEM_SIZE_MASK                 0x03u
#define  SLI_USBD_HID_REPORT_ITEM_TYPE_MASK                 0x0Cu
#define  SLI_USBD_HID_REPORT_ITEM_TAG_MASK                  0xF0u

#define  SLI_USBD_HID_IDLE_INFINITE                         0x00u
#define  SLI_USBD_HID_IDLE_ALL_REPORT                       0x00u

/********************************************************************************************************
 ********************************************************************************************************
 *                                       LOCAL FUNCTION PROTOTYPES
 ********************************************************************************************************
 *******************************************************************************************************/

static void usbd_hid_report_clear(sli_usbd_hid_report_t *p_report);

static sli_usbd_hid_report_id_t *usbd_hid_report_allocate_id(void);

static sli_usbd_hid_report_id_t *usbd_hid_report_get_id(sli_usbd_hid_report_t      *p_report,
                                                        sli_usbd_hid_report_type_t report_type,
                                                        uint8_t                    report_id);

/********************************************************************************************************
 ********************************************************************************************************
 *                                           GLOBAL FUNCTIONS
 ********************************************************************************************************
 *******************************************************************************************************/

/****************************************************************************************************//**
 * Initialize HID report module
 *******************************************************************************************************/
sl_status_t sli_usbd_hid_report_init(void)
{
  uint16_t ix;

  for (ix = 0u; ix < SL_USBD_HID_REPORT_ID_QUANTITY; ix++) {
    sli_usbd_hid_report_id_t *p_report_id = &usbd_hid_ptr->report_id_table[ix];

    p_report_id->id = 0u;
    p_report_id->size = 0u;
    p_report_id->data_ptr = NULL;
    p_report_id->next_ptr = NULL;

    p_report_id->class_nbr = SL_USBD_CLASS_NBR_NONE;
    p_report_id->idle_count = 0u;
    p_report_id->idle_rate = SLI_USBD_HID_IDLE_INFINITE;
    p_report_id->update = false;
    p_report_id->timer_next_ptr = NULL;
  }

  usbd_hid_ptr->report_id_table_index = SL_USBD_HID_REPORT_ID_QUANTITY;
  usbd_hid_ptr->report_id_timer_list = NULL;

  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Parse HID report
 *******************************************************************************************************/
sl_status_t sli_usbd_hid_report_parse(uint8_t                 class_nbr,
                                      const uint8_t           *p_report_data,
                                      uint16_t                report_data_len,
                                      sli_usbd_hid_report_t   *p_report)
{
  sli_usbd_hid_report_id_t   *p_report_id = NULL;
  sli_usbd_hid_report_item_t *p_item;
  uint8_t           item_tbl_size = 0u;
  uint8_t           col_nesting = 0u;
  uint8_t           report_type;

  p_item = usbd_hid_ptr->report_item_table;
  p_item->report_id = 0u;
  p_item->size = 0u;
  p_item->count = 0u;

  usbd_hid_report_clear(p_report);

  while (report_data_len > 0u) {
    uint8_t tag = *p_report_data;
    uint32_t data = 0u;

    p_report_data++;
    report_data_len--;

    switch (tag & SLI_USBD_HID_REPORT_ITEM_SIZE_MASK) {
      // Item size: 4 bytes.
      case 3u:
        if (report_data_len < 4u) {
          return SL_STATUS_INVALID_PARAMETER;
        }

        memcpy(&data, p_report_data, 4u);

        p_report_data += 4u;
        report_data_len -= 4u;
        break;

      // Item size: 2 bytes.
      case 2u:
        if (report_data_len < 2u) {
          return SL_STATUS_INVALID_PARAMETER;
        }
        memcpy(&data, p_report_data, 2u);

        p_report_data += 2u;
        report_data_len -= 2u;
        break;

