espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_hid_report.c
      // Item size: 1 byte.
      case 1u:
        if (report_data_len < 1u) {
          return SL_STATUS_INVALID_PARAMETER;
        }

        data = *p_report_data;

        p_report_data++;
        report_data_len--;
        break;

      // Item size: 0 bytes.
      case 0u:
      default:
        break;
    }

    switch (tag & (SLI_USBD_HID_REPORT_ITEM_TYPE_MASK
                   | SLI_USBD_HID_REPORT_ITEM_TAG_MASK)) {
      case SL_USBD_HID_MAIN_INPUT:
        p_report_id = usbd_hid_report_get_id(p_report,
                                             SLI_USBD_HID_REPORT_TYPE_INPUT,
                                             p_item->report_id);
        if (p_report_id == NULL) {
          return SL_STATUS_ALLOCATION_FAILED;
        }

        p_report_id->size += p_item->count * p_item->size;
        p_report_id->class_nbr = class_nbr;

        if (p_report->max_input_report_size < p_report_id->size) {
          p_report->max_input_report_size = p_report_id->size;
        }
        break;

      case SL_USBD_HID_MAIN_OUTPUT:
        p_report_id = usbd_hid_report_get_id(p_report,
                                             SLI_USBD_HID_REPORT_TYPE_OUTPUT,
                                             p_item->report_id);
        if (p_report_id == NULL) {
          return SL_STATUS_ALLOCATION_FAILED;
        }

        p_report_id->size += p_item->count * p_item->size;
        p_report_id->class_nbr = class_nbr;

        if (p_report->max_output_report_size < p_report_id->size) {
          p_report->max_output_report_size = p_report_id->size;
        }
        break;

      case SL_USBD_HID_MAIN_FEATURE:
        p_report_id = usbd_hid_report_get_id(p_report,
                                             SLI_USBD_HID_REPORT_TYPE_FEATURE,
                                             p_item->report_id);
        if (p_report_id == NULL) {
          return SL_STATUS_ALLOCATION_FAILED;
        }

        p_report_id->size += p_item->count * p_item->size;
        p_report_id->class_nbr = class_nbr;

        if (p_report->max_feature_report_size < p_report_id->size) {
          p_report->max_feature_report_size = p_report_id->size;
        }
        break;

      case SL_USBD_HID_MAIN_COLLECTION:
        col_nesting++;
        break;

      case SL_USBD_HID_MAIN_ENDCOLLECTION:
        if (col_nesting == 0) {
          return SL_STATUS_INVALID_PARAMETER;
        }

        col_nesting--;
        break;

      case SL_USBD_HID_GLOBAL_REPORT_SIZE:
        p_item->size = data & 0xFFFFu;
        break;

      case SL_USBD_HID_GLOBAL_REPORT_COUNT:
        p_item->count = data & 0xFFFFu;
        break;

      case SL_USBD_HID_GLOBAL_REPORT_ID:
        p_item->report_id = data & 0xFFu;
        p_report->has_reports = true;
        break;

      case SL_USBD_HID_GLOBAL_PUSH:
#if (SL_USBD_HID_PUSH_POP_ITEM_QUANTITY > 0)
        if (item_tbl_size >= SL_USBD_HID_PUSH_POP_ITEM_QUANTITY) {
          return SL_STATUS_ALLOCATION_FAILED;
        }
#endif
        p_item = &usbd_hid_ptr->report_item_table[item_tbl_size + 1u];

        p_item->report_id = usbd_hid_ptr->report_item_table[item_tbl_size].report_id;
        p_item->size = usbd_hid_ptr->report_item_table[item_tbl_size].size;
        p_item->count = usbd_hid_ptr->report_item_table[item_tbl_size].count;

        item_tbl_size++;
        break;

      case SL_USBD_HID_GLOBAL_POP:
        if (item_tbl_size == 0u) {
          return SL_STATUS_INVALID_PARAMETER;
        }

        item_tbl_size--;
        p_item = &usbd_hid_ptr->report_item_table[item_tbl_size];
        break;

      case SL_USBD_HID_LOCAL_USAGE:
      case SL_USBD_HID_LOCAL_USAGE_MIN:
      case SL_USBD_HID_LOCAL_USAGE_MAX:
      case SL_USBD_HID_GLOBAL_USAGE_PAGE:
      case SL_USBD_HID_GLOBAL_LOG_MIN:
      case SL_USBD_HID_GLOBAL_LOG_MAX:
      case SL_USBD_HID_GLOBAL_PHY_MIN:
      case SL_USBD_HID_GLOBAL_PHY_MAX:
      case SL_USBD_HID_GLOBAL_UNIT_EXPONENT:
      case SL_USBD_HID_GLOBAL_UNIT:
      case SL_USBD_HID_LOCAL_DESIGNATOR_INDEX:
      case SL_USBD_HID_LOCAL_DESIGNATOR_MIN:
      case SL_USBD_HID_LOCAL_DESIGNATOR_MAX:
      case SL_USBD_HID_LOCAL_STRING_INDEX:
      case SL_USBD_HID_LOCAL_STRING_MIN:
      case SL_USBD_HID_LOCAL_STRING_MAX:
      case SL_USBD_HID_LOCAL_DELIMITER:
        break;

      default:
        return SL_STATUS_INVALID_PARAMETER;
    }
  }

  if (col_nesting != 0u) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Convert Report Size to Octets
  p_report->max_input_report_size += 7u;
  p_report->max_input_report_size /= 8u;

  p_report->max_output_report_size += 7u;
  p_report->max_output_report_size /= 8u;

  p_report->max_feature_report_size += 7u;
  p_report->max_feature_report_size /= 8u;

  // Reserve space for report id.
  if (p_report->has_reports == true) {
    if (p_report->max_input_report_size > 0u) {
      p_report->max_input_report_size++;
    }
    if (p_report->max_output_report_size > 0u) {
      p_report->max_output_report_size++;
    }
    if (p_report->max_feature_report_size > 0u) {
      p_report->max_feature_report_size++;
    }
  }

  if (p_report->max_output_report_size > 0u) {
    // Make sure the allocated size is multiple of 4 for alignment
    uint32_t alloc_size = SLI_USBD_ROUND_INC_UP_PWR2(p_report->max_output_report_size, 4);
    p_report->max_output_report_ptr = (uint8_t *)sl_malloc(alloc_size);
    if (p_report->max_output_report_ptr == NULL) {
      return SL_STATUS_ALLOCATION_FAILED;
    }
  }

  if (p_report->max_feature_report_size > 0u) {
    // Make sure the allocated size is multiple of 4 for alignment
    uint32_t alloc_size = SLI_USBD_ROUND_INC_UP_PWR2(p_report->max_feature_report_size, 4);
    p_report->max_feature_report_ptr = (uint8_t *)sl_malloc(alloc_size);
    if (p_report->max_feature_report_ptr == NULL) {
      return SL_STATUS_ALLOCATION_FAILED;
    }
  }

  for (report_type = 0; report_type < 3u; report_type++) {
    p_report_id = p_report->reports[report_type];
    while (p_report_id != NULL) {
      p_report_id->size += 7u;
      p_report_id->size /= 8u;

      if (p_report_id->size > 0u) {
        if (p_report->has_reports == true) {
          // Reserve space for report id.
          p_report_id->size++;
        }
        // Input reports use individual buf.
        if (report_type == 0u) {
          // Make sure the allocated size for data is multiple of 4 for alignment
          uint32_t alloc_size = SLI_USBD_ROUND_INC_UP_PWR2(p_report_id->size, 4);
          p_report_id->data_ptr = (uint8_t *)sl_malloc(alloc_size);
          if (p_report_id->data_ptr == NULL) {
            return SL_STATUS_ALLOCATION_FAILED;
          }
          // The first byte must be the report id.
          memset(&p_report_id->data_ptr[0u], 0, p_report_id->size);
          p_report_id->data_ptr[0u] = p_report_id->id;
        }
      }

      p_report_id = p_report_id->next_ptr;
    }
  }

