espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_hid_report.c
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Retrieve HID report length and pointer to its data area
 *******************************************************************************************************/
sl_status_t sli_usbd_hid_report_get_info(const sli_usbd_hid_report_t *p_report,
                                         sli_usbd_hid_report_type_t  report_type,
                                         uint8_t                     report_id,
                                         uint8_t                     **p_buf,
                                         bool                        *p_is_largest,
                                         uint16_t                    *p_length)
{
  sli_usbd_hid_report_id_t *p_report_id;

  switch (report_type) {
    case SLI_USBD_HID_REPORT_TYPE_INPUT:
      p_report_id = p_report->reports[0u];
      break;

    case SLI_USBD_HID_REPORT_TYPE_OUTPUT:
      p_report_id = p_report->reports[1u];
      break;

    case SLI_USBD_HID_REPORT_TYPE_FEATURE:
      p_report_id = p_report->reports[2u];
      break;

    case SLI_USBD_HID_REPORT_TYPE_NONE:
    default:
      *p_length = 0;
      return SL_STATUS_INVALID_PARAMETER;
  }

  while (p_report_id != NULL) {
    if (p_report_id->id == report_id) {
      switch (report_type) {
        case SLI_USBD_HID_REPORT_TYPE_INPUT:
          if (p_buf != NULL) {
            *p_buf = p_report_id->data_ptr;
          }
          *p_is_largest = (p_report_id->size == p_report->max_input_report_size) ? true : false;
          break;

        case SLI_USBD_HID_REPORT_TYPE_OUTPUT:
          if (p_buf != NULL) {
            *p_buf = p_report->max_output_report_ptr;
          }
          *p_is_largest = false;
          break;

        case SLI_USBD_HID_REPORT_TYPE_FEATURE:
        default:
          if (p_buf != NULL) {
            *p_buf = p_report->max_feature_report_ptr;
          }
          *p_is_largest = (p_report_id->size == p_report->max_feature_report_size) ? true : false;
          break;
      }
      *p_length = p_report_id->size;
      return SL_STATUS_OK;
    }

    p_report_id = p_report_id->next_ptr;
  }

  *p_length = 0;
  return SL_STATUS_INVALID_PARAMETER;
}

/****************************************************************************************************//**
 * Process all periodic HID input reports
 *******************************************************************************************************/
sl_status_t sli_usbd_hid_report_timer_task_handler(void)
{
  sli_usbd_hid_report_id_t *p_report_id;
  sli_usbd_hid_report_id_t *p_report_id_prev;
  bool        service;
  uint32_t         xfer_len;
  CORE_DECLARE_IRQ_STATE;

  p_report_id_prev = (sli_usbd_hid_report_id_t *)0;
  CORE_ENTER_ATOMIC();
  p_report_id = usbd_hid_ptr->report_id_timer_list;
  CORE_EXIT_ATOMIC();

  while (p_report_id != NULL) {
    service = false;

    CORE_ENTER_ATOMIC();
    if (p_report_id->idle_rate == SLI_USBD_HID_IDLE_INFINITE) {
      p_report_id->idle_count = 0u;
      p_report_id->update = false;

      if (p_report_id_prev == NULL) {
        usbd_hid_ptr->report_id_timer_list = p_report_id->timer_next_ptr;
      } else {
        p_report_id_prev->timer_next_ptr = p_report_id->timer_next_ptr;
      }

      p_report_id->timer_next_ptr = NULL;
    } else {
      if (p_report_id->update == true) {
        p_report_id->update = false;

        if (p_report_id->idle_count > 1) {
          p_report_id->idle_count = p_report_id->idle_rate;
        }
      }

      if (p_report_id->idle_count > 1) {
        p_report_id->idle_count--;
      } else {
        p_report_id->idle_count = p_report_id->idle_rate;
        service = true;
      }
    }
    CORE_EXIT_ATOMIC();

    if (service == true) {
      sl_usbd_hid_write_sync(p_report_id->class_nbr,
                             p_report_id->data_ptr,
                             p_report_id->size,
                             100,
                             &xfer_len);
    }

    p_report_id_prev = p_report_id;
    p_report_id = p_report_id->timer_next_ptr;
  }

  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Retrieve HID input report idle rate
 *******************************************************************************************************/
sl_status_t sli_usbd_hid_report_get_idle_rate(const sli_usbd_hid_report_t *p_report,
                                              uint8_t                     report_id,
                                              uint8_t                     *p_idle_rate)
{
  sli_usbd_hid_report_id_t *p_report_id;

  p_report_id = p_report->reports[0u];

  while (p_report_id != NULL) {
    if (p_report_id->id == report_id) {
      *p_idle_rate = p_report_id->idle_rate;
      return SL_STATUS_OK;
    }

    p_report_id = p_report_id->next_ptr;
  }

  *p_idle_rate = 0u;
  return SL_STATUS_INVALID_PARAMETER;
}

/****************************************************************************************************//**
 * Set HID input report idle rate
 *******************************************************************************************************/
sl_status_t sli_usbd_hid_report_set_idle_rate(const sli_usbd_hid_report_t *p_report,
                                              uint8_t                     report_id,
                                              uint8_t                     idle_rate)
{
  sli_usbd_hid_report_id_t *p_report_id;
  sl_status_t          status;
  CORE_DECLARE_IRQ_STATE;

  p_report_id = p_report->reports[0u];

  status = SL_STATUS_INVALID_PARAMETER;

  while (p_report_id != NULL) {
    if ((p_report_id->id == report_id)
        || (report_id == SLI_USBD_HID_IDLE_ALL_REPORT)) {
      if (idle_rate != SLI_USBD_HID_IDLE_INFINITE) {
        CORE_ENTER_ATOMIC();
        // Add report id into timer list.
        if (p_report_id->idle_rate == SLI_USBD_HID_IDLE_INFINITE) {
          p_report_id->timer_next_ptr = usbd_hid_ptr->report_id_timer_list;
          usbd_hid_ptr->report_id_timer_list = p_report_id;
        }

        p_report_id->idle_rate = idle_rate;
        p_report_id->update = true;

        CORE_EXIT_ATOMIC();
      } else {
        CORE_ENTER_ATOMIC();
        p_report_id->idle_rate = SLI_USBD_HID_IDLE_INFINITE;
        CORE_EXIT_ATOMIC();
      }

      status = SL_STATUS_OK;

      if (report_id != SLI_USBD_HID_IDLE_ALL_REPORT) {
        return status;
      }
    }

    p_report_id = p_report_id->next_ptr;
  }

