espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_hid_report.c
  return status;
}

/****************************************************************************************************//**
 * Remove all HID input report from periodic service list
 *******************************************************************************************************/
sl_status_t sli_usbd_hid_report_remove_all_idle(const sli_usbd_hid_report_t *p_report)
{
  sli_usbd_hid_report_id_t *p_report_id;
  CORE_DECLARE_IRQ_STATE;

  p_report_id = p_report->reports[0u];

  while (p_report_id != NULL) {
    // Remove only reports present on timer list.
    CORE_ENTER_ATOMIC();
    if (p_report_id->timer_next_ptr != NULL) {
      p_report_id->idle_rate = SLI_USBD_HID_IDLE_INFINITE;
    }
    CORE_EXIT_ATOMIC();

    p_report_id = p_report_id->next_ptr;
  }

  return SL_STATUS_OK;
}

/********************************************************************************************************
 ********************************************************************************************************
 *                                           LOCAL FUNCTIONS
 ********************************************************************************************************
 *******************************************************************************************************/

/****************************************************************************************************//**
 *                                           usbd_hid_report_clear()
 *
 * @brief    Initialize HID report structure.
 *
 * @param    p_report    Pointer to HID report structure.
 *******************************************************************************************************/
static void usbd_hid_report_clear(sli_usbd_hid_report_t *p_report)
{
  p_report->has_reports = 0;
  p_report->max_input_report_size = 0;
  p_report->max_output_report_size = 0;
  p_report->max_feature_report_size = 0;

  p_report->max_output_report_ptr = NULL;
  p_report->max_feature_report_ptr = NULL;

  p_report->reports[0u] = NULL;
  p_report->reports[1u] = NULL;
  p_report->reports[2u] = NULL;
}

/****************************************************************************************************//**
 *                                           usbd_hid_report_allocate_id()
 *
 * @brief    Allocate an instance of HID report id structure.
 *
 * @return   Pointer to HID report id structure, if NO error(s).
 *
 *           Pointer to NULL,                    otherwise.
 *******************************************************************************************************/
static sli_usbd_hid_report_id_t *usbd_hid_report_allocate_id(void)
{
  sli_usbd_hid_report_id_t *p_report_id;
  CORE_DECLARE_IRQ_STATE;

  CORE_ENTER_ATOMIC();
  if (usbd_hid_ptr->report_id_table_index == 0u) {
    CORE_EXIT_ATOMIC();
    return (NULL);
  }

  usbd_hid_ptr->report_id_table_index--;

  p_report_id = &usbd_hid_ptr->report_id_table[usbd_hid_ptr->report_id_table_index];
  CORE_EXIT_ATOMIC();

  return (p_report_id);
}

/****************************************************************************************************//**
 *                                           usbd_hid_report_get_id()
 *
 * @brief    Retrieve HID report id structure.
 *
 * @param    p_report        Pointer to HID report structure.
 *
 * @param    report_type     HID report type.
 *
 * @param    report_id       HID report id.
 *
 * @return   Pointer to HID report id structure, if NO error(s).
 *
 *           Pointer to NULL,                    otherwise.
 *
 * @note     (1) If HID report id structure is not available for the specific report type and id, an
 *               instance of HID report id structure is allocated and linked into the HID report
 *               structure.
 *******************************************************************************************************/
static sli_usbd_hid_report_id_t *usbd_hid_report_get_id(sli_usbd_hid_report_t      *p_report,
                                                        sli_usbd_hid_report_type_t report_type,
                                                        uint8_t                    report_id)
{
  sli_usbd_hid_report_id_t *p_report_id;
  sli_usbd_hid_report_id_t *p_report_id_prev;
  uint8_t         type;

  switch (report_type) {
    case SLI_USBD_HID_REPORT_TYPE_INPUT:
      type = 0u;
      break;

    case SLI_USBD_HID_REPORT_TYPE_OUTPUT:
      type = 1u;
      break;

    case SLI_USBD_HID_REPORT_TYPE_FEATURE:
      type = 2u;
      break;

    case SLI_USBD_HID_REPORT_TYPE_NONE:
    default:
      return (NULL);
  }

  if (p_report->has_reports == false) {
    if (report_id > 0) {
      return (NULL);
    }

    if (p_report->reports[type] == NULL) {
      p_report->reports[type] = usbd_hid_report_allocate_id();
      if (p_report->reports[type] == NULL) {
        return (NULL);
      }
    }

    p_report_id = p_report->reports[type];

    return (p_report_id);
  }

  p_report_id = p_report->reports[type];
  p_report_id_prev = NULL;
  while (p_report_id != NULL) {
    if (p_report_id->id == report_id) {
      return (p_report_id);
    }

    p_report_id_prev = p_report_id;
    p_report_id = p_report_id->next_ptr;
  }

  p_report_id = usbd_hid_report_allocate_id();
  if (p_report_id == NULL) {
    return (NULL);
  }

  p_report_id->id = report_id;

  if (p_report->reports[type] == NULL) {
    p_report->reports[type] = p_report_id;
  } else {
    p_report_id_prev->next_ptr = p_report_id;
  }

  return (p_report_id);
}
